
# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.

# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.

# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.

# Вам требуется написать программу, которая проверяет счастливость билета с номером n и выводит на экран yes или no.

n = 385916
sum = 0
sum1 = 0

for i in str(n%1000):
    sum1 +=int(i)
for j in str(n//1000):
    sum +=int(j)

if sum1 == sum:
    print(f"yes")
else:
    print(f"no")
